FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/instance/instance_pwm1.h
    #define REG_PWM1_CMPMUPD2    ( *( __O uint32_t * ) 0x4005C15CU )  /**< \brief (PWM1) PWM Comparison 2 Mode Update Register */
    #define REG_PWM1_CMPV3       ( *( __IO uint32_t * ) 0x4005C160U ) /**< \brief (PWM1) PWM Comparison 3 Value Register */
    #define REG_PWM1_CMPVUPD3    ( *( __O uint32_t * ) 0x4005C164U )  /**< \brief (PWM1) PWM Comparison 3 Value Update Register */
    #define REG_PWM1_CMPM3       ( *( __IO uint32_t * ) 0x4005C168U ) /**< \brief (PWM1) PWM Comparison 3 Mode Register */
    #define REG_PWM1_CMPMUPD3    ( *( __O uint32_t * ) 0x4005C16CU )  /**< \brief (PWM1) PWM Comparison 3 Mode Update Register */
    #define REG_PWM1_CMPV4       ( *( __IO uint32_t * ) 0x4005C170U ) /**< \brief (PWM1) PWM Comparison 4 Value Register */
    #define REG_PWM1_CMPVUPD4    ( *( __O uint32_t * ) 0x4005C174U )  /**< \brief (PWM1) PWM Comparison 4 Value Update Register */
    #define REG_PWM1_CMPM4       ( *( __IO uint32_t * ) 0x4005C178U ) /**< \brief (PWM1) PWM Comparison 4 Mode Register */
    #define REG_PWM1_CMPMUPD4    ( *( __O uint32_t * ) 0x4005C17CU )  /**< \brief (PWM1) PWM Comparison 4 Mode Update Register */
    #define REG_PWM1_CMPV5       ( *( __IO uint32_t * ) 0x4005C180U ) /**< \brief (PWM1) PWM Comparison 5 Value Register */
    #define REG_PWM1_CMPVUPD5    ( *( __O uint32_t * ) 0x4005C184U )  /**< \brief (PWM1) PWM Comparison 5 Value Update Register */
    #define REG_PWM1_CMPM5       ( *( __IO uint32_t * ) 0x4005C188U ) /**< \brief (PWM1) PWM Comparison 5 Mode Register */
    #define REG_PWM1_CMPMUPD5    ( *( __O uint32_t * ) 0x4005C18CU )  /**< \brief (PWM1) PWM Comparison 5 Mode Update Register */
    #define REG_PWM1_CMPV6       ( *( __IO uint32_t * ) 0x4005C190U ) /**< \brief (PWM1) PWM Comparison 6 Value Register */
    #define REG_PWM1_CMPVUPD6    ( *( __O uint32_t * ) 0x4005C194U )  /**< \brief (PWM1) PWM Comparison 6 Value Update Register */
    #define REG_PWM1_CMPM6       ( *( __IO uint32_t * ) 0x4005C198U ) /**< \brief (PWM1) PWM Comparison 6 Mode Register */
    #define REG_PWM1_CMPMUPD6    ( *( __O uint32_t * ) 0x4005C19CU )  /**< \brief (PWM1) PWM Comparison 6 Mode Update Register */
    #define REG_PWM1_CMPV7       ( *( __IO uint32_t * ) 0x4005C1A0U ) /**< \brief (PWM1) PWM Comparison 7 Value Register */
    #define REG_PWM1_CMPVUPD7    ( *( __O uint32_t * ) 0x4005C1A4U )  /**< \brief (PWM1) PWM Comparison 7 Value Update Register */
    #define REG_PWM1_CMPM7       ( *( __IO uint32_t * ) 0x4005C1A8U ) /**< \brief (PWM1) PWM Comparison 7 Mode Register */
    #define REG_PWM1_CMPMUPD7    ( *( __O uint32_t * ) 0x4005C1ACU )  /**< \brief (PWM1) PWM Comparison 7 Mode Update Register */
    #define REG_PWM1_CMR0        ( *( __IO uint32_t * ) 0x4005C200U ) /**< \brief (PWM1) PWM Channel Mode Register (ch_num = 0) */
    #define REG_PWM1_CDTY0       ( *( __IO uint32_t * ) 0x4005C204U ) /**< \brief (PWM1) PWM Channel Duty Cycle Register (ch_num = 0) */
    #define REG_PWM1_CDTYUPD0    ( *( __O uint32_t * ) 0x4005C208U )  /**< \brief (PWM1) PWM Channel Duty Cycle Update Register (ch_num = 0) */
    #define REG_PWM1_CPRD0       ( *( __IO uint32_t * ) 0x4005C20CU ) /**< \brief (PWM1) PWM Channel Period Register (ch_num = 0) */
    #define REG_PWM1_CPRDUPD0    ( *( __O uint32_t * ) 0x4005C210U )  /**< \brief (PWM1) PWM Channel Period Update Register (ch_num = 0) */
    #define REG_PWM1_CCNT0       ( *( __I uint32_t * ) 0x4005C214U )  /**< \brief (PWM1) PWM Channel Counter Register (ch_num = 0) */
    #define REG_PWM1_DT0         ( *( __IO uint32_t * ) 0x4005C218U ) /**< \brief (PWM1) PWM Channel Dead Time Register (ch_num = 0) */
    #define REG_PWM1_DTUPD0      ( *( __O uint32_t * ) 0x4005C21CU )  /**< \brief (PWM1) PWM Channel Dead Time Update Register (ch_num = 0) */
    #define REG_PWM1_CMR1        ( *( __IO uint32_t * ) 0x4005C220U ) /**< \brief (PWM1) PWM Channel Mode Register (ch_num = 1) */
    #define REG_PWM1_CDTY1       ( *( __IO uint32_t * ) 0x4005C224U ) /**< \brief (PWM1) PWM Channel Duty Cycle Register (ch_num = 1) */
    #define REG_PWM1_CDTYUPD1    ( *( __O uint32_t * ) 0x4005C228U )  /**< \brief (PWM1) PWM Channel Duty Cycle Update Register (ch_num = 1) */
    #define REG_PWM1_CPRD1       ( *( __IO uint32_t * ) 0x4005C22CU ) /**< \brief (PWM1) PWM Channel Period Register (ch_num = 1) */
    #define REG_PWM1_CPRDUPD1    ( *( __O uint32_t * ) 0x4005C230U )  /**< \brief (PWM1) PWM Channel Period Update Register (ch_num = 1) */
    #define REG_PWM1_CCNT1       ( *( __I uint32_t * ) 0x4005C234U )  /**< \brief (PWM1) PWM Channel Counter Register (ch_num = 1) */
    #define REG_PWM1_DT1         ( *( __IO uint32_t * ) 0x4005C238U ) /**< \brief (PWM1) PWM Channel Dead Time Register (ch_num = 1) */
    #define REG_PWM1_DTUPD1      ( *( __O uint32_t * ) 0x4005C23CU )  /**< \brief (PWM1) PWM Channel Dead Time Update Register (ch_num = 1) */
    #define REG_PWM1_CMR2        ( *( __IO uint32_t * ) 0x4005C240U ) /**< \brief (PWM1) PWM Channel Mode Register (ch_num = 2) */
    #define REG_PWM1_CDTY2       ( *( __IO uint32_t * ) 0x4005C244U ) /**< \brief (PWM1) PWM Channel Duty Cycle Register (ch_num = 2) */
    #define REG_PWM1_CDTYUPD2    ( *( __O uint32_t * ) 0x4005C248U )  /**< \brief (PWM1) PWM Channel Duty Cycle Update Register (ch_num = 2) */
    #define REG_PWM1_CPRD2       ( *( __IO uint32_t * ) 0x4005C24CU ) /**< \brief (PWM1) PWM Channel Period Register (ch_num = 2) */
    #define REG_PWM1_CPRDUPD2    ( *( __O uint32_t * ) 0x4005C250U )  /**< \brief (PWM1) PWM Channel Period Update Register (ch_num = 2) */
    #define REG_PWM1_CCNT2       ( *( __I uint32_t * ) 0x4005C254U )  /**< \brief (PWM1) PWM Channel Counter Register (ch_num = 2) */
    #define REG_PWM1_DT2         ( *( __IO uint32_t * ) 0x4005C258U ) /**< \brief (PWM1) PWM Channel Dead Time Register (ch_num = 2) */
    #define REG_PWM1_DTUPD2      ( *( __O uint32_t * ) 0x4005C25CU )  /**< \brief (PWM1) PWM Channel Dead Time Update Register (ch_num = 2) */
    #define REG_PWM1_CMR3        ( *( __IO uint32_t * ) 0x4005C260U ) /**< \brief (PWM1) PWM Channel Mode Register (ch_num = 3) */
    #define REG_PWM1_CDTY3       ( *( __IO uint32_t * ) 0x4005C264U ) /**< \brief (PWM1) PWM Channel Duty Cycle Register (ch_num = 3) */
    #define REG_PWM1_CDTYUPD3    ( *( __O uint32_t * ) 0x4005C268U )  /**< \brief (PWM1) PWM Channel Duty Cycle Update Register (ch_num = 3) */
    #define REG_PWM1_CPRD3       ( *( __IO uint32_t * ) 0x4005C26CU ) /**< \brief (PWM1) PWM Channel Period Register (ch_num = 3) */
    #define REG_PWM1_CPRDUPD3    ( *( __O uint32_t * ) 0x4005C270U )  /**< \brief (PWM1) PWM Channel Period Update Register (ch_num = 3) */
    #define REG_PWM1_CCNT3       ( *( __I uint32_t * ) 0x4005C274U )  /**< \brief (PWM1) PWM Channel Counter Register (ch_num = 3) */
    #define REG_PWM1_DT3         ( *( __IO uint32_t * ) 0x4005C278U ) /**< \brief (PWM1) PWM Channel Dead Time Register (ch_num = 3) */
    #define REG_PWM1_DTUPD3      ( *( __O uint32_t * ) 0x4005C27CU )  /**< \brief (PWM1) PWM Channel Dead Time Update Register (ch_num = 3) */
    #define REG_PWM1_CMUPD0      ( *( __O uint32_t * ) 0x4005C400U )  /**< \brief (PWM1) PWM Channel Mode Update Register (ch_num = 0) */
    #define REG_PWM1_CAE0        ( *( __IO uint32_t * ) 0x4005C404U ) /**< \brief (PWM1) PWM Channel Additional Edge Register (ch_num = 0) */
    #define REG_PWM1_CAEUPD0     ( *( __O uint32_t * ) 0x4005C408U )  /**< \brief (PWM1) PWM Channel Additional Edge Update Register (ch_num = 0) */
    #define REG_PWM1_CMUPD1      ( *( __O uint32_t * ) 0x4005C420U )  /**< \brief (PWM1) PWM Channel Mode Update Register (ch_num = 1) */
    #define REG_PWM1_CAE1        ( *( __IO uint32_t * ) 0x4005C424U ) /**< \brief (PWM1) PWM Channel Additional Edge Register (ch_num = 1) */
    #define REG_PWM1_CAEUPD1     ( *( __O uint32_t * ) 0x4005C428U )  /**< \brief (PWM1) PWM Channel Additional Edge Update Register (ch_num = 1) */
    #define REG_PWM1_ETRG1       ( *( __IO uint32_t * ) 0x4005C42CU ) /**< \brief (PWM1) PWM External Trigger Register (trg_num = 1) */
    #define REG_PWM1_LEBR1       ( *( __IO uint32_t * ) 0x4005C430U ) /**< \brief (PWM1) PWM Leading-Edge Blanking Register (trg_num = 1) */
    #define REG_PWM1_CMUPD2      ( *( __O uint32_t * ) 0x4005C440U )  /**< \brief (PWM1) PWM Channel Mode Update Register (ch_num = 2) */
    #define REG_PWM1_CAE2        ( *( __IO uint32_t * ) 0x4005C444U ) /**< \brief (PWM1) PWM Channel Additional Edge Register (ch_num = 2) */
    #define REG_PWM1_CAEUPD2     ( *( __O uint32_t * ) 0x4005C448U )  /**< \brief (PWM1) PWM Channel Additional Edge Update Register (ch_num = 2) */
    #define REG_PWM1_ETRG2       ( *( __IO uint32_t * ) 0x4005C44CU ) /**< \brief (PWM1) PWM External Trigger Register (trg_num = 2) */
    #define REG_PWM1_LEBR2       ( *( __IO uint32_t * ) 0x4005C450U ) /**< \brief (PWM1) PWM Leading-Edge Blanking Register (trg_num = 2) */
    #define REG_PWM1_CMUPD3      ( *( __O uint32_t * ) 0x4005C460U )  /**< \brief (PWM1) PWM Channel Mode Update Register (ch_num = 3) */
    #define REG_PWM1_CAE3        ( *( __IO uint32_t * ) 0x4005C464U ) /**< \brief (PWM1) PWM Channel Additional Edge Register (ch_num = 3) */
    #define REG_PWM1_CAEUPD3     ( *( __O uint32_t * ) 0x4005C468U )  /**< \brief (PWM1) PWM Channel Additional Edge Update Register (ch_num = 3) */
    #define REG_PWM1_ETRG3       ( *( __IO uint32_t * ) 0x4005C46CU ) /**< \brief (PWM1) PWM External Trigger Register (trg_num = 3) */
    #define REG_PWM1_LEBR3       ( *( __IO uint32_t * ) 0x4005C470U ) /**< \brief (PWM1) PWM Leading-Edge Blanking Register (trg_num = 3) */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* _SAM_PWM1_INSTANCE_ */
